# PANDAS :

# The process of cleaning messy data from given Raw data is called Data Munging or Data Wrangling..

# Data Frame is a main object in pandas,as it is used to represent data with rows and columns(tabular or excel spreadsheet like data)....

 # CSV File : it is used to store tabular data like database or excel spreasd sheet.Files in the CSV format can be imported to and exported from programs that store data in tables, such as Microsoft Excel or OpenOffice Calc. CSV stands for "comma-separated values"

In [1]:
import pandas as pd

In [12]:
df = pd.read_csv("weather_report.csv")
df

          Day  Temparature  Windspeed  event
0    1/1/2020           32          6   Rain
1    1/2/2020           35          7  Sunny
2    1/3/2020           28          2   Snow
3    1/4/2020           24          7   Snow
4    1/5/2020           32          4   Rain
5    1/6/2020           32          2  Sunny
6    1/7/2020           33          5   Snow
7    1/8/2020           32          7  Sunny
8    1/9/2020           28          6  Sunny
9   1/10/2020           29          2   Rain
10  1/11/2020           30          4   Snow

In [13]:
df.shape # gives dimensions such as rows and columns

(11, 4)

In [14]:
df.head() # we will get the first 5 out of following

        Day  Temparature  Windspeed  event
0  1/1/2020           32          6   Rain
1  1/2/2020           35          7  Sunny
2  1/3/2020           28          2   Snow
3  1/4/2020           24          7   Snow
4  1/5/2020           32          4   Rain

In [14]:
df.head(2) # gives first 2 rows..

        Day  Temparature  Windspeed  event
0  1/1/2020           32          6   Rain
1  1/2/2020           35          7  Sunny

In [15]:
df.tail() # we will get the last 5 columns of data

          Day  Temparature  Windspeed  event
6    1/7/2020           33          5   Snow
7    1/8/2020           32          7  Sunny
8    1/9/2020           28          6  Sunny
9   1/10/2020           29          2   Rain
10  1/11/2020           30          4   Snow

In [15]:
df.tail(3) # gives last 3 rows..

          Day  Temparature  Windspeed  event
8    1/9/2020           28          6  Sunny
9   1/10/2020           29          2   Rain
10  1/11/2020           30          4   Snow

In [16]:
df[4:7] # will give the data from  4 - 6

        Day  Temparature  Windspeed  event
4  1/5/2020           32          4   Rain
5  1/6/2020           32          2  Sunny
6  1/7/2020           33          5   Snow

In [17]:
df.columns # it will give the columns

Index([' Day', 'Temparature', 'Windspeed', 'event'], dtype='object')

In [20]:
df ['event']

0      Rain
1     Sunny
2      Snow
3      Snow
4      Rain
5     Sunny
6      Snow
7     Sunny
8     Sunny
9      Rain
10     Snow
Name: event, dtype: object

In [24]:
df[1: ]

          Day  Temparature  Windspeed  event
1    1/2/2020           35          7  Sunny
2    1/3/2020           28          2   Snow
3    1/4/2020           24          7   Snow
4    1/5/2020           32          4   Rain
5    1/6/2020           32          2  Sunny
6    1/7/2020           33          5   Snow
7    1/8/2020           32          7  Sunny
8    1/9/2020           28          6  Sunny
9   1/10/2020           29          2   Rain
10  1/11/2020           30          4   Snow

In [34]:
df.head(5).tail(1) # gets particular row...

        Day  Temparature  Windspeed event
4  1/5/2020           32          4  Rain

In [26]:
df[['event',' Day']] # want to print  any 2 or more specific columns...

    event        Day
0    Rain   1/1/2020
1   Sunny   1/2/2020
2    Snow   1/3/2020
3    Snow   1/4/2020
4    Rain   1/5/2020
5   Sunny   1/6/2020
6    Snow   1/7/2020
7   Sunny   1/8/2020
8   Sunny   1/9/2020
9    Rain  1/10/2020
10   Snow  1/11/2020

In [28]:
df['Temparature'].max()

35

In [29]:
df['Temparature'].min()

24

In [30]:
df['Temparature'].mean()

30.454545454545453

In [31]:
df['Temparature'].std() # gives standard deviation...

3.0451153135353133

In [32]:
df['Temparature'].var() # gives variance..

9.27272727272727

In [35]:
df[df.Temparature>=32] # same as like mysql commands to access data by using condition...

        Day  Temparature  Windspeed  event
0  1/1/2020           32          6   Rain
1  1/2/2020           35          7  Sunny
4  1/5/2020           32          4   Rain
5  1/6/2020           32          2  Sunny
6  1/7/2020           33          5   Snow
7  1/8/2020           32          7  Sunny

In [36]:
df[df.Temparature == df.Temparature.max()] # we can use any one like below..

        Day  Temparature  Windspeed  event
1  1/2/2020           35          7  Sunny

In [37]:
df[df.Temparature == df['Temparature'].min()] # but if column name as space in b/w words use this.....

        Day  Temparature  Windspeed event
3  1/4/2020           24          7  Snow

In [42]:
df['event'][df.Temparature == df['Temparature'].min()] # we get particular column for that condition...

3    Snow
Name: event, dtype: object

In [33]:
df.describe() # gives statistics of data..

       Temparature  Windspeed
count    11.000000  11.000000
mean     30.454545   4.727273
std       3.045115   2.053821
min      24.000000   2.000000
25%      28.500000   3.000000
50%      32.000000   5.000000
75%      32.000000   6.500000
max      35.000000   7.000000

In [19]:
df.dtypes  # gives type of datatype of particular column

 Day           object
Temparature     int64
Windspeed       int64
event          object
dtype: object

# creating Data frames

#  Q: create dob,names of your family,friends..

In [24]:
dob = [2000,2004,1988,2002,2000,1974]
names = ['Sudheer','Rakul','MB','Shiva','Rash','RC']

In [25]:
DataSet = list(zip(names,dob))

In [26]:
df = pd.DataFrame(data = DataSet, columns=['Names', 'DOB'])
df

     Names   DOB
0  Sudheer  2000
1    Rakul  2004
2       MB  1988
3    Shiva  2002
4     Rash  2000
5       RC  1974

In [27]:
#saving Dataframe as csv file
df.to_csv('births.csv')

In [28]:
# we can get particular column
df['DOB']

0    2000
1    2004
2    1988
3    2002
4    2000
5    1974
Name: DOB, dtype: int64

In [30]:
type(df['DOB'])

pandas.core.series.Series

In [32]:
# Selecting multiple columns at once..
df[['DOB','Names']]

    DOB    Names
0  2000  Sudheer
1  2004    Rakul
2  1988       MB
3  2002    Shiva
4  2000     Rash
5  1974       RC

In [33]:
year = df['DOB']

In [34]:
year

0    2000
1    2004
2    1988
3    2002
4    2000
5    1974
Name: DOB, dtype: int64

# we can also create Dataframe by using Dictionary..

In [3]:
 student_marks = {
     'names': ['sudheer','Varshath','Kotesh','Prabandh','Vishruth'],
     'marks': ['98','99','99','95','98'],
     'college' : ['IIITS','IIT-BHU','NITW','TECH','IIITS']
    
}

In [4]:
df = pd.DataFrame(student_marks)
df

      names marks  college
0   sudheer    98    IIITS
1  Varshath    99  IIT-BHU
2    Kotesh    99     NITW
3  Prabandh    95     TECH
4  Vishruth    98    IIITS

In [50]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [51]:
 df.set_index('names') # it just prints the new  data it does not modified the data...

         marks  college
names
sudheer     98    IIITS
Varshath    99  IIT-BHU
Kotesh      99     NITW
Prabandh    95     TECH
Vishruth    98    IIITS

In [52]:
df

      names marks  college
0   sudheer    98    IIITS
1  Varshath    99  IIT-BHU
2    Kotesh    99     NITW
3  Prabandh    95     TECH
4  Vishruth    98    IIITS

In [59]:
df.set_index('names',inplace=True)  # here if e useinplace it can save permanently...

In [60]:
df

         marks  college
names
sudheer     98    IIITS
Varshath    99  IIT-BHU
Kotesh      99     NITW
Prabandh    95     TECH
Vishruth    98    IIITS

In [61]:
df.reset_index(inplace=True) # we will get the orignal table...

In [62]:
df

      names marks  college
0   sudheer    98    IIITS
1  Varshath    99  IIT-BHU
2    Kotesh    99     NITW
3  Prabandh    95     TECH
4  Vishruth    98    IIITS

In [10]:
df.set_index('marks',inplace=True)

In [11]:
df

          names  college
marks
98      sudheer    IIITS
99     Varshath  IIT-BHU
99       Kotesh     NITW
95     Prabandh     TECH
98     Vishruth    IIITS

In [17]:
df.loc['99'] #  it will locate the data for the conditon equals...like we can keep any column as index and get the required info...

          names  college
marks
99     Varshath  IIT-BHU
99       Kotesh     NITW

# creating DataFrames by excel

In [ ]:
 # df= pd.read_excel("filenamem",["sheet no"])
 # df

# Read Write Excel CSV file :

In [5]:
import pandas as pd
df = pd.read_csv("stock_data.csv")
df

  Stocks_data     Unnamed: 1 Unnamed: 2 Unnamed: 3     Unnamed: 4
0     Tickers            EPS    Revenue      Price         People
1       GOOGL          27.82         87        845   large people
2         WMT           4.61        484         65           n.a.
3        MSFT             -1         85         64     bill gates
4         RIL  not availible         50       1023  mukesh ambani
5        TATA            5.6         -1       n.a.     ratan tata

In [11]:
df = pd.read_csv("stock_data.csv",skiprows = 1) # here it will skip the first 1 row... we can also write header =1
df

  Tickers            EPS  Revenue Price         People
0   GOOGL          27.82       87   845   large people
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3     RIL  not availible       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [13]:
df = pd.read_csv("stock_data.csv",header = None) # if we remove the header of any one column like tickers,eps....
df

       0              1    2     3              4
0  GOOGL          27.82   87   845   large people
1    WMT           4.61  484    65           n.a.
2   MSFT             -1   85    64     bill gates
3    RIL  not availible   50  1023  mukesh ambani
4   TATA            5.6   -1  n.a.     ratan tata

In [14]:
df = pd.read_csv("stock_data.csv",header = None,names= ["Tickers","EPS","Revenue","Price","People"]) 
df

  Tickers            EPS  Revenue Price         People
0   GOOGL          27.82       87   845   large people
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3     RIL  not availible       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [19]:
df = pd.read_csv("stock_data.csv",nrows = 3)  # if we want to read only few rows 
print(df)
print()
df1 = pd.read_csv("stock_data.csv",na_values = ["not availible","n.a."]) #used for cleaning the messy data...
print(df1)

  Tickers    EPS  Revenue  Price        People
0   GOOGL  27.82       87    845  large people
1     WMT   4.61      484     65          n.a.
2    MSFT  -1.00       85     64    bill gates

  Tickers    EPS  Revenue   Price         People
0   GOOGL  27.82       87   845.0   large people
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3     RIL    NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

In [59]:
# here if we observe revenue can't be negative...but eps can be negative..
# so inorder to change only in revenue use dictionaries...
df = pd.read_csv("stock_data.csv",na_values = {
    'EPS' : ["not availible","n.a."],
    'Revenue' : ["not availible","n.a.",-1],
    'Price' : ["not availible","n.a."],
    'People':["not availible","n.a.",-1]
              }
                )
df

  Tickers    EPS  Revenue   Price         People
0   GOOGL  27.82     87.0   845.0   large people
1     WMT   4.61    484.0    65.0            NaN
2    MSFT  -1.00     85.0    64.0     bill gates
3     RIL    NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [60]:
df

  Tickers    EPS  Revenue   Price         People
0   GOOGL  27.82     87.0   845.0   large people
1     WMT   4.61    484.0    65.0            NaN
2    MSFT  -1.00     85.0    64.0     bill gates
3     RIL    NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [62]:
df.columns

Index(['Tickers', 'EPS', 'Revenue', 'Price', 'People'], dtype='object')

# Writing to the  csv file :

In [63]:
df.to_csv("new.csv",columns= ["Tickers","Revenue"]) # if you want only particular columns....

In [65]:
df.to_csv("new.csv") # if u want to remove index use index = False

In [67]:
df.to_csv("new.csv",header=False) # used to remove headers.......

# Read to the excel file...

In [18]:
import pandas as pd

In [19]:
df = pd.read_excel("stock_data.xlsx")
df

  Tickers            EPS  Revenue Price         People
0   GOOGL          27.82       87   845   large people
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3     RIL  not availible       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [35]:
def convert_People_cell(cell):
    if cell == "n.a.":
        return 'sam walton'
    return cell


df = pd.read_excel("stock_data.xlsx",converters = {
    'People' : convert_People_cell()
}
)
df

TypeError: convert_People_cell() missing 1 required positional argument: 'cell'

In [28]:
df = pd.read_excel("stock_data.xlsx")
df

  Tickers            EPS  Revenue Price         People
0   GOOGL          27.82       87   845   large people
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3     RIL  not availible       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [11]:
df.to_excel("new1.xlsx",sheet_name = "stocks",index =False,startrow=1,startcol=2) # we can start from any where....

In [17]:
df.marking =pd.DataFrame({
     'names': ['sudheer','Varshath','Kotesh','Prabandh','Vishruth'],
     'marks': ['98','99','99','95','98'],
     'college' : ['IIITS','IIT-BHU','NITW','TECH','IIITS']
    
})
df.city = pd.DataFrame({
    'dist' : ['vizag','hyd','nzb','tpty','bmgl']
})

In [25]:
#with pd.ExcelWriter('marking_city.xlsx') as writer:
 #   df_marking.to_excel(writer,sheet_name = 'marking')
  #  df_city.to_excel(writer,sheet_name = 'city')
df

  Tickers            EPS  Revenue Price         People
0   GOOGL          27.82       87   845   large people
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3     RIL  not availible       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata